api/app/Http/Controllers/MessageController.php

    public function getCount()
    {
        $sendCount = DB::table('kb_b_msg_send')
            ->where('kb_b_msg_send.send_date', '!=', null)
            ->count();
        $openCount = DB::table('kb_b_msg_send')
            ->where('kb_b_msg_send.open_date', '!=', null)
            ->count();
        $confirmCount = DB::table('kb_b_msg_send')
            ->where('kb_b_msg_send.kakunin_date', '!=', null)
            ->count();
        $replyCount = DB::table('kb_b_msg_send')
            ->where('kb_b_msg_send.henshin_date', '!=', null)
            ->count();
---
SELECT count(*) as aggregate FROM "kb_b_msg_send" WHERE "kb_b_msg_send"."send_date" IS not NULL
SELECT count(*) as aggregate FROM "kb_b_msg_send" WHERE "kb_b_msg_send"."open_date" IS not NULL
SELECT count(*) as aggregate FROM "kb_b_msg_send" WHERE "kb_b_msg_send"."kakunin_date" IS not NULL
SELECT count(*) as aggregate FROM "kb_b_msg_send" WHERE "kb_b_msg_send"."henshin_date" IS not NULL

    public function getMngerMessage(GetWorkerMsgRequest $request)
    {
        $this->arr_logincheck = [];
        $this->g_loginUser = $request->all()['login_worker'];
        $login_user = DB::table('login')
            ->select('syain_id')
            ->get();
---
SELECT "syain_id" FROM "login"

    public function getReservationMsgs(GetWorkerMsgRequest $request)
    {
        $this->g_reservationLoginUser = $request->all()['login_worker'];
        $msg_reservation = DB::table('kb_b_msg_send')
            ->where(
                'kb_b_msg_send.send_to_syain',
                '=',
                $this->g_reservationLoginUser
            )
            ->where('kb_b_msg_send.send_yoyaku_date', '!=', null)
            ->where('kb_b_msg_send.send_date', '=', null)
            ->get();
---
SELECT * FROM "kb_b_msg_send" WHERE "kb_b_msg_send"."send_to_syain" = 3077 and "kb_b_msg_send"."send_yoyaku_date" IS not NULL and "kb_b_msg_send"."send_date" IS NULL