api/app/Http/Controllers/StaffController.php

    public function index()
    {
        $this->arr_logincheck = [];
        $login_user = DB::table('login')
            ->select('syain_id')
            ->get();
---
SELECT "syain_id" FROM "login"