api/app/Http/Controllers/WorkerMsgController.php

SELECT "syain_id" FROM "login"
---
    public function getWorkerMsgs(GetWorkerMsgRequest $request)
    {
        $this->arr_logincheck = [];
        $this->g_loginUser = $request->all()['login_worker'];
        $login_user = DB::table('login')
            ->select('syain_id')
            ->get();